## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 19 to add, 11 to change, 5 to destroy.</code></pre>

* Create
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]
  * azurerm_private_dns_zone_virtual_network_link.webapps[&#34;00&#34;]
  * azurerm_private_dns_zone_virtual_network_link.webapps[&#34;01&#34;]
  * azurerm_private_dns_zone_virtual_network_link.webapps[&#34;02&#34;]
  * azurerm_private_endpoint.functionapp[&#34;00&#34;]
  * azurerm_private_endpoint.functionapp[&#34;01&#34;]
  * azurerm_private_endpoint.functionapp[&#34;02&#34;]
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
* Delete
  * azurerm_private_dns_zone.blob
  * azurerm_private_dns_zone.file
  * azurerm_private_dns_zone_virtual_network_link.file_link[&#34;00&#34;]
  * azurerm_private_dns_zone_virtual_network_link.file_link[&#34;01&#34;]
  * azurerm_private_dns_zone_virtual_network_link.file_link[&#34;02&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          + "BUILD_FLAGS"                                           = "UseExpressBuild"
          + "ENABLE_ORYX_BUILD"                                     = "true"
          + "ENVIRONMENT"                                           = "sbox"
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          + "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          + "LZ_KEY"                                                = "00"
          + "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          + "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "true"
          + "WEBSITE_CONTENTAZUREFILECONNECTIONSTRING"              = (sensitive value)
          + "WEBSITE_CONTENTOVERVNET"                               = "1"
          + "WEBSITE_CONTENTSHARE"                                  = "af-aplfpa-sbox00-uks-dlrm-01"
          + "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          + "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          + "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-aplfpa-sbox00-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest00-main-sbox"
      + service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfpa-sbox00-uks-dlrm-01"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest00xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "FtpsOnly"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + runtime_scale_monitoring_enabled        = true
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.10"
              + use_dotnet_isolated_runtime = false
            }
        }

      + timeouts {
          + read   = "10m"
          + update = "40m"
        }
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          + "BUILD_FLAGS"                                           = "UseExpressBuild"
          + "ENABLE_ORYX_BUILD"                                     = "true"
          + "ENVIRONMENT"                                           = "sbox"
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          + "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          + "LZ_KEY"                                                = "00"
          + "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          + "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "true"
          + "WEBSITE_CONTENTAZUREFILECONNECTIONSTRING"              = (sensitive value)
          + "WEBSITE_CONTENTOVERVNET"                               = "1"
          + "WEBSITE_CONTENTSHARE"                                  = "af-aplfta-sbox00-uks-dlrm-01"
          + "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          + "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          + "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-aplfta-sbox00-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest00-main-sbox"
      + service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfta-sbox00-uks-dlrm-01"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest00xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "FtpsOnly"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + runtime_scale_monitoring_enabled        = true
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.10"
              + use_dotnet_isolated_runtime = false
            }
        }

      + timeouts {
          + read   = "10m"
          + update = "40m"
        }
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (14 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox00-uks-dlrm-01"
        name                                           = "af-apluta-sbox00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          + "BUILD_FLAGS"                                           = "UseExpressBuild"
          + "ENABLE_ORYX_BUILD"                                     = "true"
          + "ENVIRONMENT"                                           = "sbox"
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          + "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          + "LZ_KEY"                                                = "00"
          + "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          + "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "true"
          + "WEBSITE_CONTENTAZUREFILECONNECTIONSTRING"              = (sensitive value)
          + "WEBSITE_CONTENTOVERVNET"                               = "1"
          + "WEBSITE_CONTENTSHARE"                                  = "af-bails-sbox00-uks-dlrm-01"
          + "WEBSITE_RUN_FROM_PACKAGE"                              = "1"
          + "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          + "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-bails-sbox00-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest00-main-sbox"
      + service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-bails-sbox00-uks-dlrm-01"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest00xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "FtpsOnly"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-td-sbox02-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest02-main-sbox"
      + service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-td-sbox02-uks-dlrm-01"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest02xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "FtpsOnly"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + runtime_scale_monitoring_enabled        = true
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.10"
              + use_dotnet_isolated_runtime = false
            }
        }

      + timeouts {
          + read   = "10m"
          + update = "40m"
        }
    }

  # azurerm_private_dns_zone.blob will be destroyed
  # (because azurerm_private_dns_zone.blob is not in configuration)
  - resource "azurerm_private_dns_zone" "blob" {
      - id                                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.blob.core.windows.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "ingest00-main-sbox" -> null
      - tags                                                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.blob.core.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # azurerm_private_dns_zone.file will be destroyed
  # (because azurerm_private_dns_zone.file is not in configuration)
  - resource "azurerm_private_dns_zone" "file" {
      - id                                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.file.core.windows.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "ingest00-main-sbox" -> null
      - tags                                                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.file.core.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # azurerm_private_dns_zone_virtual_network_link.file_link["00"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.file_link is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "file_link" {
      - id                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net/virtualNetworkLinks/link-file-00" -> null
      - name                  = "link-file-00" -> null
      - private_dns_zone_name = "privatelink.file.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "ingest00-main-sbox" -> null
      - tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
      - virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox" -> null
    }

  # azurerm_private_dns_zone_virtual_network_link.file_link["01"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.file_link is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "file_link" {
      - id                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net/virtualNetworkLinks/link-file-01" -> null
      - name                  = "link-file-01" -> null
      - private_dns_zone_name = "privatelink.file.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "ingest00-main-sbox" -> null
      - tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
      - virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox" -> null
    }

  # azurerm_private_dns_zone_virtual_network_link.file_link["02"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.file_link is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "file_link" {
      - id                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net/virtualNetworkLinks/link-file-02" -> null
      - name                  = "link-file-02" -> null
      - private_dns_zone_name = "privatelink.file.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "ingest00-main-sbox" -> null
      - tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
      - virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox" -> null
    }

  # azurerm_private_dns_zone_virtual_network_link.webapps["00"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "webapps" {
      + id                    = (known after apply)
      + name                  = "vnet-link-00-webapps"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resource_group_name   = "ingest00-network-sbox"
      + virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox"
    }

  # azurerm_private_dns_zone_virtual_network_link.webapps["01"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "webapps" {
      + id                    = (known after apply)
      + name                  = "vnet-link-01-webapps"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resource_group_name   = "ingest00-network-sbox"
      + virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox"
    }

  # azurerm_private_dns_zone_virtual_network_link.webapps["02"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "webapps" {
      + id                    = (known after apply)
      + name                  = "vnet-link-02-webapps"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resource_group_name   = "ingest00-network-sbox"
      + virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox"
    }

  # azurerm_private_endpoint.functionapp["00"] will be created
  + resource "azurerm_private_endpoint" "functionapp" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "pe-00-functionapp"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-main-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = [
              + "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "psc-00-blob"
          + private_connection_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00xcuttingsbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_private_endpoint.functionapp["01"] will be created
  + resource "azurerm_private_endpoint" "functionapp" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "pe-01-functionapp"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-main-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox/subnets/ingest01-data-product-001-sbox"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = [
              + "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "psc-01-blob"
          + private_connection_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01xcuttingsbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_private_endpoint.functionapp["02"] will be created
  + resource "azurerm_private_endpoint" "functionapp" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "pe-02-functionapp"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest02-main-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox/subnets/ingest02-data-product-001-sbox"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = [
              + "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "psc-02-blob"
          + private_connection_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest02xcuttingsbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 19 to add, 11 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":114,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->